Continued plan output from previous comment.
<details><summary>Show Output</summary>

```diff
3:::svep-backend-temp-20250524134904624400000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250524134904629800000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryGTF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryGTF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-pluginConsequence",
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250524134904629800000002",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCF will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCF" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCF",
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryVCFsubmit",
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:GetObject",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*/project-files/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::gasi-dataportal-20250524134911180600000001",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-queryVCFsubmit will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-queryVCFsubmit" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-queryGTF",
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-sendJobEmail",
            ]
        }
      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-sendJobEmail will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "lambda-sendJobEmail" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "lambda:InvokeFunction",
            ]
          + resources = [
              + (known after apply),
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
            ]
        }
      + statement {
          + actions   = [
              + "cognito-idp:ListUsers",
            ]
          + resources = [
              + "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN",
            ]
        }
    }

  # module.svep[0].data.aws_iam_policy_document.lambda-updateReferenceFiles will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_iam_policy_document" "lambda-updateReferenceFiles" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "s3:DeleteObject",
              + "s3:GetObject",
              + "s3:PutObject",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*",
            ]
        }
      + statement {
          + actions   = [
              + "s3:ListBucket",
            ]
          + resources = [
              + "arn:aws:s3:::svep-backend-references-20250524134904629800000002",
            ]
        }
      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + resources = [
              + "arn:aws:sns:ap-southeast-3:127214202110:svep-backend-updateReferenceFiles",
            ]
        }
      + statement {
          + actions   = [
              + "dynamodb:DescribeTable",
              + "dynamodb:GetItem",
              + "dynamodb:PutItem",
              + "dynamodb:UpdateItem",
            ]
          + resources = [
              + "arn:aws:dynamodb:ap-southeast-3:127214202110:table/svep-references",
            ]
        }
      + statement {
          + actions   = [
              + "ec2:CreateTags",
              + "ec2:DescribeImages",
              + "ec2:DescribeInstances",
              + "ec2:RunInstances",
            ]
          + resources = [
              + "*",
            ]
        }
      + statement {
          + actions   = [
              + "iam:PassRole",
            ]
          + resources = [
              + "arn:aws:iam::127214202110:role/svep_backend_ec2_references_instance_role",
            ]
        }
    }

  # module.svep[0].aws_api_gateway_method_settings.VPApi will be updated in-place
  ~ resource "aws_api_gateway_method_settings" "VPApi" {
        id          = "49hervuih0-prod-*/*"
        # (3 unchanged attributes hidden)

      ~ settings {
          ~ throttling_burst_limit                     = 1000 -> 100
          ~ throttling_rate_limit                      = 100 -> 10
            # (8 unchanged attributes hidden)
        }
    }

  # module.svep[0].aws_cloudwatch_event_rule.delete_clinical_trigger will be created
  + resource "aws_cloudwatch_event_rule" "delete_clinical_trigger" {
      + arn                 = (known after apply)
      + description         = "A scheduled trigger that checks for pending jobs in clinical workflows and deletes them."
      + event_bus_name      = "default"
      + force_destroy       = false
      + id                  = (known after apply)
      + name                = "svep_delete_clinical_trigger"
      + name_prefix         = (known after apply)
      + schedule_expression = "cron(0 16 * * ? *)"
      + tags_all            = (known after apply)
    }

  # module.svep[0].aws_cloudwatch_event_target.delete_clinical_trigger will be created
  + resource "aws_cloudwatch_event_target" "delete_clinical_trigger" {
      + arn            = (known after apply)
      + event_bus_name = "default"
      + force_destroy  = false
      + id             = (known after apply)
      + rule           = "svep_delete_clinical_trigger"
      + target_id      = "lambda-deleteClinicalWorkflow"
    }

  # module.svep[0].aws_dynamodb_table.svep_references will be updated in-place
  ~ resource "aws_dynamodb_table" "svep_references" {
        id                          = "svep-references"
        name                        = "svep-references"
      ~ tags                        = {
            "Environment" = "uat"
            "NAME"        = "svep-backend"
            "Owner"       = "gaspi"
          + "backup"      = "true"
        }
      ~ tags_all                    = {
          + "backup"      = "true"
            # (3 unchanged elements hidden)
        }
        # (11 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.svep[0].aws_iam_role_policy.ec2_references_policy will be updated in-place
  ~ resource "aws_iam_role_policy" "ec2_references_policy" {
        id          = "svep_backend_ec2_references_instance_role:svep_backend_ec2_references_policy"
        name        = "svep_backend_ec2_references_policy"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "s3:PutObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-references-20250524134904629800000002/*"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:PutItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/svep-references"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_layer_version.binaries_layer must be replaced
+/- resource "aws_lambda_layer_version" "binaries_layer" {
      ~ arn                         = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6" -> (known after apply)
      ~ code_sha256                 = "VQQaX8Wkj6o61yZU+tfAnaWwDgtcusdayrPxABC7hjg=" -> (known after apply)
      - compatible_architectures    = [] -> null
      ~ created_date                = "2025-05-30T06:52:07.709+0000" -> (known after apply)
      ~ id                          = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer:6" -> (known after apply)
      ~ layer_arn                   = "arn:aws:lambda:ap-southeast-3:127214202110:layer:svep_backend_binaries_layer" -> (known after apply)
      + signing_job_arn             = (known after apply)
      + signing_profile_version_arn = (known after apply)
      ~ source_code_hash            = "X2d7lGV/qqDKnH/DwRqSMLL95pWwV4gPa4u64BieNPPo4Z89BcZpS/ETF+5Kf+JgHz/jfrkjhkBfnSjAPWm5sg==" -> (known after apply) # forces replacement
      ~ source_code_size            = 17951199 -> (known after apply)
      ~ version                     = "6" -> (known after apply)
        # (6 unchanged attributes hidden)
    }

  # module.svep[0].aws_lambda_permission.cloudwatch_delete_clinical_workflow_invoke_permission will be created
  + resource "aws_lambda_permission" "cloudwatch_delete_clinical_workflow_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-deleteClinicalWorkflow"
      + id                  = (known after apply)
      + principal           = "events.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "CloudwatchDeleteClinicalWorkflowAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_constraint_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_constraint_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomadConstraint"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_lambda_permission.plugin_plugin_gnomad_one_kg_invoke_permission will be created
  + resource "aws_lambda_permission" "plugin_plugin_gnomad_one_kg_invoke_permission" {
      + action              = "lambda:InvokeFunction"
      + function_name       = "svep-backend-pluginGnomadOneKG"
      + id                  = (known after apply)
      + principal           = "sns.amazonaws.com"
      + source_arn          = (known after apply)
      + statement_id        = "SNSPluginGnomadAllowInvoke"
      + statement_id_prefix = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadConstraint will be created
  + resource "aws_sns_topic" "pluginGnomadConstraint" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomadConstraint"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic.pluginGnomadOneKG will be created
  + resource "aws_sns_topic" "pluginGnomadOneKG" {
      + arn                         = (known after apply)
      + beginning_archive_time      = (known after apply)
      + content_based_deduplication = false
      + fifo_throughput_scope       = (known after apply)
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "svep-backend-pluginGnomadOneKG"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + signature_version           = (known after apply)
      + tags_all                    = (known after apply)
      + tracing_config              = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadConstraint will be created
  + resource "aws_sns_topic_subscription" "pluginGnomadConstraint" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].aws_sns_topic_subscription.pluginGnomadOneKG will be created
  + resource "aws_sns_topic_subscription" "pluginGnomadOneKG" {
      + arn                             = (known after apply)
      + confirmation_timeout_in_minutes = 1
      + confirmation_was_authenticated  = (known after apply)
      + endpoint                        = (known after apply)
      + endpoint_auto_confirms          = false
      + filter_policy_scope             = (known after apply)
      + id                              = (known after apply)
      + owner_id                        = (known after apply)
      + pending_confirmation            = (known after apply)
      + protocol                        = "lambda"
      + raw_message_delivery            = false
      + topic_arn                       = (known after apply)
    }

  # module.svep[0].null_resource.init_script must be replaced
+/- resource "null_resource" "init_script" {
      ~ id       = "886702314745782383" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "script_hash" = "6a6009963759ae87469ede88fa3568c232c26e6e" -> "01e727bcc92faebfec86a58bf89ce955a0845b92"
        }
    }

  # module.webgui.aws_cloudfront_response_headers_policy.bui-security-headers-policy will be updated in-place
  ~ resource "aws_cloudfront_response_headers_policy" "bui-security-headers-policy" {
        id      = "a6381278-82e0-412f-b296-65e14e230d9b"
        name    = "bui-security-headers-policy"
        # (3 unchanged attributes hidden)

      ~ security_headers_config {
          ~ content_security_policy {
              ~ content_security_policy = "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gasi-dataportal-20250524134911180600000001.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d1t3hneobuhzmj.cloudfront.net/prod/ https://dqasu6tglsme4.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gasi-dataportal-20250524134911180600000001.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';" -> "default-src 'none'; script-src 'self' 'sha256-2P8mXF+NOGY5a6oJ1jDjLINrckn9RgJYdEesn+Qf4rQ=' https://cdn.jsdelivr.net/npm/igv@3.1.2/dist/igv.min.js; style-src 'self' 'unsafe-inline'; font-src 'self' https://fonts.gstatic.com; img-src 'self' data: content: blob: https://gasi-dataportal-20250524134911180600000001.s3.ap-southeast-3.amazonaws.com; form-action 'self'; connect-src 'self' https://d1t3hneobuhzmj.cloudfront.net/prod/ https://dqasu6tglsme4.cloudfront.net/prod/ https://cognito-identity.ap-southeast-3.amazonaws.com https://cognito-idp.ap-southeast-3.amazonaws.com https://gasi-dataportal-20250524134911180600000001.s3.ap-southeast-3.amazonaws.com https://api.pricing.us-east-1.amazonaws.com https://igv.org/genomes/ https://hgdownload.soe.ucsc.edu/goldenPath/hg38/ https://eutils.ncbi.nlm.nih.gov/entrez/eutils/; frame-ancestors 'none'; base-uri 'self'; object-src 'none'; manifest-src 'self';"
                # (1 unchanged attribute hidden)
            }

            # (5 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.webgui.aws_s3_object.version will be created
  + resource "aws_s3_object" "version" {
      + acl                    = (known after apply)
      + arn                    = (known after apply)
      + bucket                 = "webgui-bucket-20250524134912733100000001"
      + bucket_key_enabled     = (known after apply)
      + checksum_crc32         = (known after apply)
      + checksum_crc32c        = (known after apply)
      + checksum_crc64nvme     = (known after apply)
      + checksum_sha1          = (known after apply)
      + checksum_sha256        = (known after apply)
      + content                = "v0.13.4-alpha-27-g5262528"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + force_destroy          = false
      + id                     = (known after apply)
      + key                    = "version.txt"
      + kms_key_id             = (known after apply)
      + server_side_encryption = (known after apply)
      + storage_class          = (known after apply)
      + tags_all               = {
          + "Environment" = "uat"
          + "NAME"        = "portal-frontend"
          + "Owner"       = "gaspi"
        }
      + version_id             = (known after apply)
    }

  # module.webgui.null_resource.cloudfront-invalidate must be replaced
-/+ resource "null_resource" "cloudfront-invalidate" {
      ~ id       = "3996702766241245563" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "1dbd61c76392e2e7ea35eaf0f696980786097b4c" -> "42ee5d3d1463b90ec087808e0c9e00d6d0c095a6"
        }
    }

  # module.webgui.null_resource.s3-upload must be replaced
-/+ resource "null_resource" "s3-upload" {
      ~ id       = "6719585621058372774" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "compiled_code_hash" = "1dbd61c76392e2e7ea35eaf0f696980786097b4c" -> "42ee5d3d1463b90ec087808e0c9e00d6d0c095a6"
            # (1 unchanged element hidden)
        }
    }

  # module.webgui.terraform_data.cloudfront-version-invalidate will be created
  + resource "terraform_data" "cloudfront-version-invalidate" {
      + id               = (known after apply)
      + triggers_replace = [
          + "v0.13.4-alpha-27-g5262528",
        ]
    }

  # module.cognito.module.lambda-customMessageLambdaTrigger.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8789270117124479859" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587723727125800" -> "1750236046620778000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-logEmailDelivery.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "468654306493039247" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587723639158000" -> "1750236047154936000"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.data.aws_iam_policy_document.logs[0] will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "logs" {
      + id            = (known after apply)
      + json          = (known after apply)
      + minified_json = (known after apply)

      + statement {
          + actions   = [
              + "logs:CreateLogGroup",
              + "logs:CreateLogStream",
              + "logs:PutLogEvents",
            ]
          + effect    = "Allow"
          + resources = (known after apply)
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_cloudwatch_log_group.lambda[0] will be created
  + resource "aws_cloudwatch_log_group" "lambda" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/lambda/cognito-sendClinicJobEmail"
      + name_prefix       = (known after apply)
      + retention_in_days = 0
      + skip_destroy      = false
      + tags              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all          = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role.lambda[0] will be created
  + resource "aws_iam_role" "lambda" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "cognito-sendClinicJobEmail"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags                  = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + tags_all              = {
          + "Environment" = "uat"
          + "NAME"        = "cognito-infrastructure"
          + "Owner"       = "gaspi"
        }
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role_policy.additional_jsons[0] will be created
  + resource "aws_iam_role_policy" "additional_jsons" {
      + id          = (known after apply)
      + name        = "cognito-sendClinicJobEmail-0"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = "ses:SendEmail"
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
                          + "arn:aws:ses:ap-southeast-3:127214202110:configuration-set/ses-feedback-config",
                        ]
                    },
                  + {
                      + Action   = "ssm:GetParameter"
                      + Effect   = "Allow"
                      + Resource = "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = "cognito-sendClinicJobEmail"
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_iam_role_policy.logs[0] will be created
  + resource "aws_iam_role_policy" "logs" {
      + id          = (known after apply)
      + name        = "cognito-sendClinicJobEmail-logs"
      + name_prefix = (known after apply)
      + policy      = (known after apply)
      + role        = "cognito-sendClinicJobEmail"
    }

  # module.cognito.module.lambda-sendClinicJobEmail.aws_lambda_function.this[0] will be created
  + resource "aws_lambda_function" "this" {
      + architectures                  = (known after apply)
      + arn                            = (known after apply)
      + code_sha256                    = (known after apply)
      + description                    = "Sends clinic status emails"
      + filename                       = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip"
      + function_name                  = "cognito-sendClinicJobEmail"
      + handler                        = "lambda_function.lambda_handler"
      + id                             = (known after apply)
      + invoke_arn                     = (known after apply)
      + last_modified                  = (known after apply)
      + memory_size                    = 512
      + package_type                   = "Zip"
      + publish                        = false
      + qualified_arn                  = (known after apply)
      + qualified_invoke_arn           = (known after apply)
      + reserved_concurrent_executions = -1
      + role                           = (known after apply)
      + runtime                        = "python3.12"
      + signing_job_arn                = (known after apply)
      + signing_profile_version_arn    = (known after apply)
      + skip_destroy                   = false
      + source_code_hash               = (known after apply)
      + source_code_size               = (known after apply)
      + tags                           = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + tags_all                       = {
          + "Environment"           = "uat"
          + "NAME"                  = "cognito-infrastructure"
          + "Owner"                 = "gaspi"
          + "terraform-aws-modules" = "lambda"
        }
      + timeout                        = 60
      + version                        = (known after apply)

      + environment {
          + variables = {
              + "BUI_SSM_PARAM_NAME"  = "bui-ssm-beacon-ui-url"
              + "SES_CONFIG_SET_NAME" = "ses-feedback-config"
              + "SES_SOURCE_EMAIL"    = "abdullah.mubarok@undp.org"
            }
        }

      + ephemeral_storage {
          + size = 512
        }

      + logging_config {
          + log_format = "Text"
          + log_group  = (known after apply)
        }

      + tracing_config (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "cognito/lambda/sendClinicJobEmail/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "cognito/lambda/sendClinicJobEmail",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.plan.json"
      + id                   = (known after apply)
    }

  # module.cognito.module.lambda-sendClinicJobEmail.null_resource.archive[0] will be created
  + resource "null_resource" "archive" {
      + id       = (known after apply)
      + triggers = {
          + "filename"  = "builds/610658c213211425fcee62511af74a9d74acc7617b3e44e0707f4a3c81b6dfe8.zip"
          + "timestamp" = "1750236046431974000"
        }
    }

  # module.cognito.module.lambda-sendRegistrationEmail.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "6967767920677681068" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "timestamp" = "1748587723132810200" -> "1750236046023296200"
            # (1 unchanged element hidden)
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_cloudwatch_log_group.lambda[0] will be destroyed
  # (because aws_cloudwatch_log_group.lambda is not in configuration)
  - resource "aws_cloudwatch_log_group" "lambda" {
      - arn               = "arn:aws:logs:ap-southeast-3:127214202110:log-group:/aws/lambda/cognito-sendSvepJobEmail" -> null
      - id                = "/aws/lambda/cognito-sendSvepJobEmail" -> null
      - log_group_class   = "STANDARD" -> null
      - name              = "/aws/lambda/cognito-sendSvepJobEmail" -> null
      - retention_in_days = 0 -> null
      - skip_destroy      = false -> null
      - tags              = {
          - "Environment" = "uat"
          - "NAME"        = "cognito-infrastructure"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all          = {
          - "Environment" = "uat"
          - "NAME"        = "cognito-infrastructure"
          - "Owner"       = "gaspi"
        } -> null
        # (2 unchanged attributes hidden)
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_iam_role.lambda[0] will be destroyed
  # (because aws_iam_role.lambda is not in configuration)
  - resource "aws_iam_role" "lambda" {
      - arn                   = "arn:aws:iam::127214202110:role/cognito-sendSvepJobEmail" -> null
      - assume_role_policy    = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "sts:AssumeRole"
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "lambda.amazonaws.com"
                        }
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - create_date           = "2025-05-26T03:40:30Z" -> null
      - force_detach_policies = true -> null
      - id                    = "cognito-sendSvepJobEmail" -> null
      - managed_policy_arns   = [] -> null
      - max_session_duration  = 3600 -> null
      - name                  = "cognito-sendSvepJobEmail" -> null
      - path                  = "/" -> null
      - tags                  = {
          - "Environment" = "uat"
          - "NAME"        = "cognito-infrastructure"
          - "Owner"       = "gaspi"
        } -> null
      - tags_all              = {
          - "Environment" = "uat"
          - "NAME"        = "cognito-infrastructure"
          - "Owner"       = "gaspi"
        } -> null
      - unique_id             = "AROAR3HUOVT7J5D52LB2I" -> null
        # (3 unchanged attributes hidden)

      - inline_policy {
          - name   = "cognito-sendSvepJobEmail-0" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = "ses:SendEmail"
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
                              - "arn:aws:ses:ap-southeast-3:127214202110:configuration-set/ses-feedback-config",
                            ]
                        },
                      - {
                          - Action   = "ssm:GetParameter"
                          - Effect   = "Allow"
                          - Resource = "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url"
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
      - inline_policy {
          - name   = "cognito-sendSvepJobEmail-logs" -> null
          - policy = jsonencode(
                {
                  - Statement = [
                      - {
                          - Action   = [
                              - "logs:PutLogEvents",
                              - "logs:CreateLogStream",
                              - "logs:CreateLogGroup",
                            ]
                          - Effect   = "Allow"
                          - Resource = [
                              - "arn:aws:logs:ap-southeast-3:127214202110:log-group:/aws/lambda/cognito-sendSvepJobEmail:*:*",
                              - "arn:aws:logs:ap-southeast-3:127214202110:log-group:/aws/lambda/cognito-sendSvepJobEmail:*",
                            ]
                        },
                    ]
                  - Version   = "2012-10-17"
                }
            ) -> null
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_iam_role_policy.additional_jsons[0] will be destroyed
  # (because aws_iam_role_policy.additional_jsons is not in configuration)
  - resource "aws_iam_role_policy" "additional_jsons" {
      - id          = "cognito-sendSvepJobEmail:cognito-sendSvepJobEmail-0" -> null
      - name        = "cognito-sendSvepJobEmail-0" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "ses:SendEmail"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:ses:ap-southeast-3:127214202110:identity/*",
                          - "arn:aws:ses:ap-southeast-3:127214202110:configuration-set/ses-feedback-config",
                        ]
                    },
                  - {
                      - Action   = "ssm:GetParameter"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:ssm:ap-southeast-3:127214202110:parameter/bui-ssm-beacon-ui-url"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "cognito-sendSvepJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_iam_role_policy.logs[0] will be destroyed
  # (because aws_iam_role_policy.logs is not in configuration)
  - resource "aws_iam_role_policy" "logs" {
      - id          = "cognito-sendSvepJobEmail:cognito-sendSvepJobEmail-logs" -> null
      - name        = "cognito-sendSvepJobEmail-logs" -> null
      - policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "logs:PutLogEvents",
                          - "logs:CreateLogStream",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:logs:ap-southeast-3:127214202110:log-group:/aws/lambda/cognito-sendSvepJobEmail:*:*",
                          - "arn:aws:logs:ap-southeast-3:127214202110:log-group:/aws/lambda/cognito-sendSvepJobEmail:*",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> null
      - role        = "cognito-sendSvepJobEmail" -> null
        # (1 unchanged attribute hidden)
    }

  # module.cognito.module.lambda-sendSvepJobEmail.aws_lambda_function.this[0] will be destroyed
  # (because aws_lambda_function.this is not in configuration)
  - resource "aws_lambda_function" "this" {
      - architectures                  = [
          - "x86_64",
        ] -> null
      - arn                            = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail" -> null
      - code_sha256                    = "dbTdPrxTZYQ7u3iuS3QnfDN+1ma+hG8UxGdwCIXUzGw=" -> null
      - description                    = "Sends svep success email on submit execution" -> null
      - filename                       = "builds/f00729ca828cf79173cf8646dad9fddc75d5d5589896998bf585d9371dbe7ceb.zip" -> null
      - function_name                  = "cognito-sendSvepJobEmail" -> null
      - handler                        = "lambda_function.lambda_handler" -> null
      - id                             = "cognito-sendSvepJobEmail" -> null
      - invoke_arn                     = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail/invocations" -> null
      - last_modified                  = "2025-05-26T04:35:15.407+0000" -> null
      - layers                         = [] -> null
      - memory_size                    = 512 -> null
      - package_type                   = "Zip" -> null
      - publish                        = false -> null
      - qualified_arn                  = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail:$LATEST" -> null
      - qualified_invoke_arn           = "arn:aws:apigateway:ap-southeast-3:lambda:path/2015-03-31/functions/arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendSvepJobEmail:$LATEST/invocations" -> null
      - reserved_concurrent_executions = -1 -> null
      - role                           = "arn:aws:iam::127214202110:role/cognito-sendSvepJobEmail" -> null
      - runtime                        = "python3.12" -> null
      - skip_destroy                   = false -> null
      - source_code_hash               = "dbTdPrxTZYQ7u3iuS3QnfDN+1ma+hG8UxGdwCIXUzGw=" -> null
      - source_code_size               = 30933 -> null
      - tags                           = {
          - "Environment"           = "uat"
          - "NAME"                  = "cognito-infrastructure"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - tags_all                       = {
          - "Environment"           = "uat"
          - "NAME"                  = "cognito-infrastructure"
          - "Owner"                 = "gaspi"
          - "terraform-aws-modules" = "lambda"
        } -> null
      - timeout                        = 60 -> null
      - version                        = "$LATEST" -> null
        # (4 unchanged attributes hidden)

      - environment {
          - variables = {
              - "BUI_SSM_PARAM_NAME"  = "bui-ssm-beacon-ui-url"
              - "SES_CONFIG_SET_NAME" = "ses-feedback-config"
              - "SES_SOURCE_EMAIL"    = "abdullah.mubarok@undp.org"
            } -> null
        }

      - ephemeral_storage {
          - size = 512 -> null
        }

      - logging_config {
          - log_format            = "Text" -> null
          - log_group             = "/aws/lambda/cognito-sendSvepJobEmail" -> null
            # (2 unchanged attributes hidden)
        }

      - tracing_config {
          - mode = "PassThrough" -> null
        }
    }

  # module.cognito.module.lambda-sendSvepJobEmail.null_resource.archive[0] will be destroyed
  # (because null_resource.archive is not in configuration)
  - resource "null_resource" "archive" {
      - id       = "6256442094184509379" -> null
      - triggers = {
          - "filename"  = "builds/f00729ca828cf79173cf8646dad9fddc75d5d5589896998bf585d9371dbe7ceb.zip"
          - "timestamp" = "1748587722869168000"
        } -> null
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_image.this will be created
  + resource "docker_image" "this" {
      + force_remove = false
      + id           = (known after apply)
      + image_id     = (known after apply)
      + keep_locally = false
      + name         = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      + repo_digest  = (known after apply)
      + triggers     = {
          + "dir_sha" = "58e1e764f9dd751b1f74d97423fb982f7f006ed3"
        }

      + build {
          + build_args     = {
              + "SHARED_LAYER_PATH" = "sbeacon/shared_resources/python-modules/python/shared"
            }
          + cache_from     = []
          + context        = "sbeacon/lambda/submitDataset"
          + dockerfile     = "Dockerfile"
          + extra_hosts    = []
          + platform       = "linux/amd64"
          + remove         = true
          + security_opt   = []
          + tag            = []
            # (12 unchanged attributes hidden)
        }
    }

  # module.sbeacon.module.docker_image_submitDataset_lambda.docker_registry_image.this must be replaced
+/- resource "docker_registry_image" "this" {
      ~ id                   = "sha256:4f62482ec585fd4af35af0046156b06e5fcc17e0bf9cc82cfa387c4c0e05b67d" -> (known after apply)
        name                 = "127214202110.dkr.ecr.ap-southeast-3.amazonaws.com/sbeacon-submitdataset-lambda-containers"
      ~ sha256_digest        = "sha256:4f62482ec585fd4af35af0046156b06e5fcc17e0bf9cc82cfa387c4c0e05b67d" -> (known after apply)
      ~ triggers             = { # forces replacement
          ~ "dir_sha" = "65caefa0b29027b44303784a0d32557cf7e39687" -> "58e1e764f9dd751b1f74d97423fb982f7f006ed3"
        }
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-admin:sbeacon-backend-admin-0"
        name        = "sbeacon-backend-admin-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = "cognito-idp:*"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                  - {
                      - Action   = [
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:GetItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-users-quota"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:lambda:ap-southeast-3:127214202110:function:cognito-sendRegistrationEmail"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-admin.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/e3cc12796b0e73597205038af877b72afc008256556d20072be67f51507f8e2f.zip" -> "builds/60b0e3a68a05054a0bf081218c963ea3d1da3fc284b98f1a9b752478fa34e747.zip"
        id                             = "sbeacon-backend-admin"
      ~ last_modified                  = "2025-05-30T06:52:21.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "DYNAMO_JUPYTER_INSTANCES_TABLE"       = "sbeacon-dataportal-juptyer-notebooks"
                # (35 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-admin.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "zip",
                          + "sbeacon/lambda/admin",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/60b0e3a68a05054a0bf081218c963ea3d1da3fc284b98f1a9b752478fa34e747.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/60b0e3a68a05054a0bf081218c963ea3d1da3fc284b98f1a9b752478fa34e747.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-admin.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "8474587843867464715" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/e3cc12796b0e73597205038af877b72afc008256556d20072be67f51507f8e2f.zip" -> "builds/60b0e3a68a05054a0bf081218c963ea3d1da3fc284b98f1a9b752478fa34e747.zip"
          ~ "timestamp" = "1748587724653455000" -> "1750236045653990000"
        }
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-0"
        name        = "sbeacon-backend-dataPortal-0"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-users-quota",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-saved-queries",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-projects",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-project-users",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-pricing-cache",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-juptyer-notebooks",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinical-variants",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinical-annotations",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs",
                        ]
                    },
                  - {
                      - Action   = "pricing:*"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "dynamodb:Query"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-project-users/index/uid-index",
                          - "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-clinic-jobs/index/project-name-index",
                        ]
                    },
                  - {
                      - Action   = "cognito-idp:ListUsers"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:cognito-idp:ap-southeast-3:127214202110:userpool/ap-southeast-3_586AXnWYN"
                    },
                  - {
                      - Action   = [
                          - "sagemaker:UpdateNotebookInstance",
                          - "sagemaker:StopNotebookInstance",
                          - "sagemaker:StartNotebookInstance",
                          - "sagemaker:ListNotebookInstances",
                          - "sagemaker:DescribeNotebookInstance",
                          - "sagemaker:DeleteNotebookInstance",
                          - "sagemaker:CreatePresignedNotebookInstanceUrl",
                          - "sagemaker:CreateNotebookInstance",
                          - "sagemaker:AddTags",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:sagemaker:ap-southeast-3:127214202110:notebook-instance/*"
                    },
                  - {
                      - Action   = "sagemaker:ListNotebookInstances"
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                  - {
                      - Action   = "iam:PassRole"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:iam::127214202110:role/sbeacon_backend_sagemaker_jupyter_instance_role"
                    },
                  - {
                      - Action    = "s3:ListBucket"
                      - Condition = {
                          - StringLike = {
                              - "s3:prefix" = [
                                  - "projects/*",
                                  - "private/*",
                                ]
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001"
                    },
                  - {
                      - Action   = [
                          - "s3:GetObject",
                          - "s3:DeleteObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:s3:::gasi-metadata-20250524134912137300000004/*",
                          - "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/projects/*",
                        ]
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::gasi-dataportal-20250524134911180600000001/private/*"
                    },
                  - {
                      - Action   = "s3:ListBucket"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001"
                    },
                  - {
                      - Action   = "s3:DeleteObject"
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::svep-backend-temp-20250524134904624400000001/*"
                    },
                  - {
                      - Action   = "lambda:InvokeFunction"
                      - Effect   = "Allow"
                      - Resource = [
                          - "arn:aws:lambda:ap-southeast-3:127214202110:function:sbeacon-backend-submitDataset",
                          - "arn:aws:lambda:ap-southeast-3:127214202110:function:sbeacon-backend-indexer",
                          - "arn:aws:lambda:ap-southeast-3:127214202110:function:sbeacon-backend-generateReports",
                          - "arn:aws:lambda:ap-southeast-3:127214202110:function:sbeacon-backend-generateCohortVCfs",
                        ]
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_iam_role_policy.additional_jsons[1] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_jsons" {
        id          = "sbeacon-backend-dataPortal:sbeacon-backend-dataPortal-1"
        name        = "sbeacon-backend-dataPortal-1"
      ~ policy      = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "dynamodb:UpdateItem",
                          - "dynamodb:Scan",
                          - "dynamodb:Query",
                          - "dynamodb:PutItem",
                          - "dynamodb:GetItem",
                          - "dynamodb:DescribeTable",
                          - "dynamodb:DeleteItem",
                          - "dynamodb:BatchWriteItem",
                          - "dynamodb:BatchGetItem",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:dynamodb:ap-southeast-3:127214202110:table/sbeacon-dataportal-mutex-locks"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (2 unchanged attributes hidden)
    }

  # module.sbeacon.module.lambda-data-portal.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
      ~ filename                       = "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.zip" -> "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.zip"
        id                             = "sbeacon-backend-dataPortal"
      ~ last_modified                  = "2025-05-30T06:53:20.000+0000" -> (known after apply)
      ~ layers                         = [
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_libraries_layer:6",
          - "arn:aws:lambda:ap-southeast-3:127214202110:layer:sbeacon_backend_python_modules_layer:2",
        ] -> (known after apply)
        tags                           = {
            "Environment"           = "uat"
            "NAME"                  = "sbeacon-backend"
            "Owner"                 = "gaspi"
            "terraform-aws-modules" = "lambda"
        }
        # (25 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              + "CLINIC_TEMP_BUCKET_NAMES"             = "svep-backend-temp-20250524134904624400000001,svep-backend-regions-20250524134906107200000005"
              - "TEMP_BUCKET_NAME"                     = "svep-backend-temp-20250524134904624400000001" -> null
                # (51 unchanged elements hidden)
            }
        }

        # (3 unchanged blocks hidden)
    }

  # module.sbeacon.module.lambda-data-portal.local_file.archive_plan[0] will be created
  + resource "local_file" "archive_plan" {
      + content              = jsonencode(
            {
              + artifacts_dir = "builds"
              + build_plan    = [
                  + [
                      + [
                          + "pip",
                          + "python3.12",
                          + "sbeacon/lambda/dataPortal/requirements.txt",
                          + null,
                          + null,
                        ],
                      + [
                          + "zip",
                          + "sbeacon/lambda/dataPortal",
                          + null,
                        ],
                    ],
                ]
              + filename      = "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.zip"
              + runtime       = "python3.12"
            }
        )
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0755"
      + file_permission      = "0644"
      + filename             = "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.plan.json"
      + id                   = (known after apply)
    }

  # module.sbeacon.module.lambda-data-portal.null_resource.archive[0] must be replaced
+/- resource "null_resource" "archive" {
      ~ id       = "5343468377926630762" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "filename"  = "builds/4b8981152d7b14a64376cd5830a8e4e4e3bf673ab2285e463b5d8c44c9050860.zip" -> "builds/f9f60af32b15f107483d73c3d85d366ed15c32a6ec1c9212409a445be726e8f7.zip"
          ~ "timestamp" = "1748587724278948000" -> "1750236046782924800"
        }
    }

  # module.sbeacon.module.lambda-deidentifyFiles.aws_iam_role_policy.additional_json[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "additional_json" {
        
```
</details>
<br>

**Warning**: Output length greater than max comment size. Continued in next comment.